sistema_chamados_rails/app/controllers/chamados_controller.rb

  def index
    # Filter logic similar to dashboard
    @chamados = Chamado.all.order(created_at: :desc)
---
SELECT "chamados".* FROM "chamados" ORDER BY "chamados"."created_at" DESC