sistema_chamados_rails/app/controllers/chamados_controller.rb

  def create
    @chamado = Chamado.new(chamado_params)
    @chamado = Chamado.new(chamado_params)
    # Status defaults to 'Aberto' if not set, or respects form selection

    if @chamado.save
---
INSERT INTO "chamados" ("data_solicitacao", "hora_solicitacao", "nome_solicitante", "ramal", "setor", "andar", "descricao_solicitacao", "constatado", "providencia", "providenciado", "status", "detalhe", "tecnico_responsavel", "data_fechamento", "created_at", "updated_at") VALUES ('2026-02-09', '2000-01-01 14:26:47.354000', 'pedro', '1234', 'CGTI', '9', 'pedro quer ligar o pc no ar condicionado', NULL, NULL, NULL, 'Aberto', 'é isso ai', NULL, NULL, '2026-02-09 14:27:21.984285', '2026-02-09 14:27:21.984285') RETURNING "id"

  def update
    if @chamado.update(chamado_params)
---
UPDATE "chamados" SET "data_solicitacao" = '2026-06-20', "hora_solicitacao" = '2000-01-01 02:37:00', "status" = 'Em Atendimento', "tecnico_responsavel" = 'Pedro', "data_fechamento" = '2026-06-20 00:00:00', "updated_at" = '2026-02-11 11:40:51.320006' WHERE "chamados"."id" = 29

  def destroy
    @chamado.destroy
---
DELETE FROM "chamados" WHERE "chamados"."id" = 33

    def set_chamado
      @chamado = Chamado.find(params[:id])
---
SELECT "chamados".* FROM "chamados" WHERE "chamados"."id" = 33 LIMIT 1