sistema_chamados_rails/app/controllers/dashboard_controller.rb

  def index
    @total_chamados = Chamado.count
    @chamados_abertos = Chamado.abertos.count
    @chamados_em_atendimento = Chamado.em_atendimento.count
    @chamados_fechados = Chamado.fechados.count

    @chamados = Chamado.recentes

    # Filters
    if params[:status].present?
      @chamados = @chamados.where(status: params[:status])
    end

    if params[:tecnico].present?
      @chamados = @chamados.where(tecnico_responsavel: params[:tecnico])
---
SELECT COUNT(*) FROM "chamados"
SELECT "chamados".* FROM "chamados" WHERE "chamados"."status" = 'Aberto' ORDER BY "chamados"."created_at" DESC
SELECT "chamados".* FROM "chamados" WHERE "chamados"."tecnico_responsavel" = 'Sidney' ORDER BY "chamados"."created_at" DESC