sistema_chamados_rails/app/models/chamado.rb

  def registrar_historico_tecnico
    ChamadoHistorico.create(
      chamado: self,
      tecnico_antigo: tecnico_responsavel_before_last_save || tecnico_responsavel_was,
      tecnico_novo: tecnico_responsavel,
      data_alteracao: Time.current
    )
---
INSERT INTO "chamado_historicos" ("chamado_id", "tecnico_antigo", "tecnico_novo", "data_alteracao", "created_at", "updated_at") VALUES (34, 'Diego', 'Maxuel', '2026-02-11 16:20:54.264974', '2026-02-11 16:20:54.295402', '2026-02-11 16:20:54.295402') RETURNING "id"