sistema_chamados_rails/app/models/tecnico.rb

  def self.nomes_ativos
    ativos.pluck(:nome)
---
SELECT "tecnicos"."nome" FROM "tecnicos" WHERE "tecnicos"."ativo" = 1