sistema_chamados_rails/app/views/chamados/_form.html.erb

          <%= form.label :tecnico_responsavel, "Técnico Responsável", class: "form-label" %>
          <%= form.select :tecnico_responsavel, Tecnico.nomes_ativos, { include_blank: "Não atribuído" }, class: "form-select" %>
---
SELECT "tecnicos"."nome" FROM "tecnicos" WHERE "tecnicos"."ativo" = 1