sistema_chamados_rails/app/views/chamados/show.html.erb

    <!-- Histórico de Técnicos -->
    <% if @chamado.chamado_historicos.any? %>
---
SELECT "chamado_historicos".* FROM "chamado_historicos" WHERE "chamado_historicos"."chamado_id" = 34 ORDER BY "chamado_historicos"."created_at" DESC
SELECT 1 AS one FROM "chamado_historicos" WHERE "chamado_historicos"."chamado_id" = 34 LIMIT 1

          <ul class="list-group list-group-flush small">
            <% @chamado.chamado_historicos.order(created_at: :desc).each do |historico| %>
---
SELECT "chamado_historicos".* FROM "chamado_historicos" WHERE "chamado_historicos"."chamado_id" = 34 ORDER BY "chamado_historicos"."created_at" DESC